#+TITLE: Emacs configuration
#+OPTIONS: num:nil
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+STARTUP: overview 

* Durchsicht f8
#+BEGIN_SRC emacs-lisp
  (setq is-alpha nil)
  (defun transform-window (a ab)
    (set-frame-parameter (selected-frame) 'alpha (list a ab))
    (add-to-list 'default-frame-alist (cons 'alpha (list a ab)))
    )
  (global-set-key [(f8)] (lambda()
                           (interactive)
                           (if is-alpha
                               (transform-window 100 100)
                             (transform-window 75 50))
                           (setq is-alpha (not is-alpha))))
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (if is-alpha (transform-window 100 100) (transform-window 75 50)) | (setq is-alpha (not is-alpha)) |
* chinese fonts
install cnfonts
M-x cnfonts-edit-profile
#+begin_src emacs-lisp
(use-package cnfonts
:ensure t
:config )

(require 'cnfonts)
;;让 cnfonts 随着 Emacs 自动生效。
 (cnfonts-enable)
;; 让 spacemacs mode-line 中的 Unicode 图标正确显示。
 (cnfonts-set-spacemacs-fallback-fonts)
( cnfonts-enable)

#+end_src

#+RESULTS:
| cnfonts-set-font-first-time |

* Latex
sudo apt install texlive-full
sudo apt install texlive-xetex

#+BEGIN_SRC emacs-lisp
  (require 'org)
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))
  (setq org-latex-create-formula-image-program 'dvipng)


  (use-package tex
  :ensure auctex)


  (setq Tex-auto-save t)
  (setq Tex-parse-self t)
  (setq-default Tex-master nil)

  (setq org-latex-compiler "xelatex")
  ;;enable cdlatex
  (add-hook 'org-mode-hook 'turn-on-org-cdlatex)

  (add-hook 'LaTeX-mode-hook
                  (lambda ()
                        (add-to-list 'TeX-command-list '("XeLaTeX" "%`xelatex --synctex=1%(mode)%' %t" TeX-run-TeX nil t))))
  (global-set-key "\C-z" 'latex-math-preview-insert-symbol)

#+END_SRC

#+RESULTS:
| turn-on-org-cdlatex | turn-on-auto-fill | turn-on-flyspell | (lambda nil (org-bullets-mode 1)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** link 

|----------+---------------+------------------------------|
| commands | function      | explain                      |
|----------+---------------+------------------------------|
| C-c C-o  | goto the link | must in the link description |
| C-c C-l  | edit the link | also in the link             |
| C-c C-.  | go back       |                              |
|----------+---------------+------------------------------|

 internal file

link define options

|----------------|
| * headline     |  
| #+NAME: target |
| <<target>>     |
|----------------|

 external file

#+begin_src 
[[.../file.org::345]] go to the file of line 345
[[.../file.org::target]] to to the file with target, 3 kinds of internal

[[file:~/code/main.c::255  ]]               进入到 255 行
[[file:~/xx.org::My Target ]]                   找到目标‘<<My Target>>’
[[file:~/xx.org::#my-custom-id]]               查找自定义 id 的项

#+end_src



#+RESULTS:
: /usr/share/ditaa/ditaa.jar

* org-roam
org-roam-mode
org-roam-db-build-cache
org-roam-find-index
org-roam-find-file
org-roam-insert

sudo apt install sqlite

#+BEGIN_SRC emacs-lisp
  (use-package org-roam-server
    :ensure t)

  (use-package org-roam-server
    :ensure t
    :config
    (setq org-roam-server-host "127.0.0.1"
          org-roam-server-port 8082
          org-roam-server-export-inline-images t
          org-roam-server-authenticate nil
          org-roam-server-label-truncate t
          org-roam-server-label-truncate-length 60
          org-roam-server-label-wrap-length 20))


  (setq org-roam-directory "~/Dropbox/")
  (add-hook 'after-init-hook 'org-roam-mode)
  (setq org-roam-completion-system 'helm)
  (setq org-roam-buffer-width 0.2)

  (defun my/org-roam--backlinks-list-with-content (file)
    (with-temp-buffer
      (if-let* ((backlinks (org-roam--get-backlinks file))
                (grouped-backlinks (--group-by (nth 0 it) backlinks)))
          (progn
            (insert (format "\n\n* %d Backlinks\n"
                            (length backlinks)))
            (dolist (group grouped-backlinks)
              (let ((file-from (car group))
                    (bls (cdr group)))
                (insert (format "** [[file:%s][%s]]\n"
                                file-from
                                (org-roam--get-title-or-slug file-from)))
                (dolist (backlink bls)
                  (pcase-let ((`(,file-from _ ,props) backlink))
                    (insert (s-trim (s-replace "\n" " " (plist-get props :content))))
                    (insert "\n\n")))))))
      (buffer-string)))

  (defun my/org-export-preprocessor (backend)
    (let ((links (my/org-roam--backlinks-list-with-content (buffer-file-name))))
      (unless (string= links "")
        (save-excursion
          (goto-char (point-max))
          (insert (concat "\n* Backlinks\n") links)))))

  (add-hook 'org-export-before-processing-hook 'my/org-export-preprocessor)


#+END_SRC

#+RESULTS:
| my/org-export-preprocessor |
** python  
M-x : package install : company-anaconda
SCR python for python2
ipython for python3
#+BEGIN_SRC emacs-lisp

    (use-package python
      :ensure t
      :mode ("\\.py\\'" . python-mode)
      :interpreter ("/usr/bin/python3.6" . python-mode)
      :config
      (setq indent-tabs-mode nil)
      (setq python-indent-offset 4)
      (use-package py-autopep8
        :ensure t
        :hook ((python-mode . py-autopep8-enable-on-save))
        ))

    (use-package company-jedi
      :ensure t
      :config
      (add-hook 'python-mode-hook 'jedi:setup)
      (add-hook 'python-mode-hook (lambda ()
                                    (add-to-list (make-local-variable 'company-backends) 'company-jedi))))


                                            ;  (exec-path-from-shell-copy-env "PYTHONPATH")
  ;;  (setq py-python-command "python")
    ;;(setq python-shell-interpreter "python")
  (setq python-shell-interpreter "python3")

    (use-package elpy
      :ensure t
      :commands (elpy-enable)
      :config
      (setq elpy-rpc-backend "jedi"))

    (use-package virtualenvwrapper
      :ensure t
      :config
      (venv-initialize-interactive-shells)
      (venv-initialize-eshell))


#+END_SRC

#+RESULTS:
| lsp | anaconda-mode | py-autopep8-enable-on-save | (lambda nil (add-to-list (make-local-variable (quote company-backends)) (quote company-jedi))) | jedi:setup |

*** C-c C-c call in src
#+begin_src haskell   :results value 
#+begin_src haskell  :results value :eval (inferior-haskell-start-process)
  log2 :: Float -> Float
    log2 = logBase 2
    log2 43

#+end_src

#+RESULTS:
: Prelude> 5.426264754702098

#+end_src
in src can multi functions be defined. and the last call will be printed

with follow extension, can be easy C-c C-c executed, but not in send
to haskell log file, but only output the last result


Seeing Literatur Programm Grundlage
** html fold
#+begin_src emacs-lisp
(autoload 'html-fold-mode "html-fold" "Minor mode for hiding and revealing elements." t)
(add-hook 'html-mode-hook 'html-fold-mode)
#+end_src

#+RESULTS:
| html-fold-mode | emmet-mode |

